//  Напишите программу которая на вход принимает одно число (N)
// а на выходе показывает все целые числа в промежутке от - N до N   
//  4 -> " -4, -3, -2, -1, 0, 1, 2, 3, 4"
//  2 -> " -2, -1, 0, 1, 2" .

Console.Write(Введите число: ");
int n = Convert.ToInt32(Consoie.Readline());
int count = -n;
Write(count <= n)
{
    Consoie.Write($"{count} ");
    count = count + 1;  // либо count++;
} 
